chat_system_1329609773_actor_description=Iron Richard. Mentor of all young knights.
chat_system_1329609773_switch_0_header_1=^?^So what - is the necromancer now intimately acquainted with the death he so loved?
chat_system_1329609773_switch_0_header_2=^?^So what - have you found the "treasure"? My legs are numb from standing here. I'm going to be late for the feast.
chat_system_1329609773_switch_0_header_3=^?^Good luck to you in the royal service, [player]! I'm sure you'll go far, and we'll hear about you one day. And I hope it will be good news...
chat_system_1329609773_snap_0_question=^?^Have you saved the princess yet? Or am I going to be waiting around here all afternoon?
chat_system_1329609773_snap_0_answer_0=^?^How can I use magic scrolls?
chat_system_1329609773_snap_0_answer_1=^?^I think I've found what you needed. By the way, what is that strange luminescence that I saw above the buried chests?
chat_system_1329609773_snap_0_answer_2=^?^As far as I understood, I need to dig out a treasure. But I don't quite understand how I should do it.
chat_system_1329609773_snap_0_answer_3=^?^I've killed the necromancer and brought you the Book.
chat_system_1329609773_snap_0_answer_4=^?^I've saved the princess! Here she is, I mean... her remains. Anyway, here they are!
chat_system_1329609773_snap_0_answer_5=^?^I saw the inscriptions on the dummy. One of them belongs to a "Richard Iron Tooth." Does this name mean anything to you? The handwriting is pretty familiar.
chat_system_1329609773_snap_0_header_5=^?^Oh, how perceptive you are! Alright, I'll tell you, but let's keep it a secret. This dummy has been used for Tests for quite a while. I used to get chased around by the dragon too - only back then they put the dummy on wheels!<br>So yes, I scratched the inscription. Back then my nickname was the Iron Tooth. Then I lost my iron tooth in another fight. So then I became just Iron Richard.
chat_system_1329609773_snap_0_answer_6=^?^The Test awaits - let's talk later.
chat_system_1329609773_snap_0_answer_7=^?^They are waiting for me elsewhere. See you later.
chat_system_1329609773_snap_2_question=^?^During combat you can open the book and read a scroll. If the spell works, the scroll disappears! You can also learn a scroll and then the spell will stay in the book forever. Learned spells can be upgraded, which increases their power.<br><br>[s]To learn a spell from a scroll, you must open the right skill in the magic school: Order, Distortion or Chaos, in the magic skills tree of your character. Then, in the Spell Book, you can turn scrolls into spells with the help of magic crystals. The more magic crystals you have, the more spells you can learn and upgrade.[/s]
chat_system_1329609773_snap_2_answer_0=^?^I have another couple of questions.
chat_system_1329609773_snap_2_answer_1=^?^I see. I don't have any more questions.
chat_system_1329609773_switch_2_header_0=^?^How long are you going to entertain me with your chatter?
chat_system_1329609773_snap_10_question=^?^Wow! The boot! So that's what I put into that damned chest. I've been looking for it for a whole month and could never find it. It's been rusted through for a long time.<br>A luminescence, you say? Ah, that's your gift revealing itself. It's a pretty rare gift, I should say. Humans with such gifts are able to find secrets hidden in the ground, treasures for example. 
chat_system_1329609773_snap_10_answer_0=^?^That means I've passed the Test?
chat_system_1329609773_snap_10_answer_1=^?^That means I've passed the Test?
chat_system_1329609773_snap_10_header_1=^?^Yes, you passed. Well done!<br>Well, well. Oh! Look at this, the coins that I hid for a rainy day! They're still here inside the heel.
chat_system_1329609773_snap_12_question=^?^Yes, you passed. Look, I had some money hidden in the heel. Have you see it? Maybe it fell out and was lying somewhere in the chest?
chat_system_1329609773_snap_12_answer_0=^?^No, I didn't see it. Maybe it's still lying in the chest.
chat_system_1329609773_snap_12_answer_1=^?^Oh yes, here it is. I found 50 coins on the bottom of the chest. Take it.
chat_system_1329609773_snap_12_header_1=^?^Strange, I remember there was more money than that. Ok, give it to me.
chat_system_1329609773_snap_12_answer_2=^?^Oh, I forgot. Here's all 100 coins, safe and sound.
chat_system_1329609773_snap_13_question=^?^Oh, really? That's too bad. Ok, I'll go to search myself.
chat_system_1329609773_snap_13_answer_0=^?^So, how about the Test?
chat_system_1329609773_snap_15_question=^?^Ah yes, let's consider everything in the right order.<br>So - the rescuing of the princess. Not bad, not bad, but... dragon hunting, to be honest with you - it's not your strong point. You could become a good evil spirits slayer. You passed the Test, so that's good!<br>But there is one more thing. That last test you passed brilliantly, and I think you can become a fine Treasure Searcher.
chat_system_1329609773_snap_15_answer_0=^?^Treasure Searcher?
chat_system_1329609773_snap_16_question=^?^Yes, to tell you the truth - it's been a long time since I've seen a student who had such potential for becoming a good Treasure Searcher. Besides, with your gift of seeing treasures...<br>This gift should serve the benefit of the Darion crown.
chat_system_1329609773_snap_16_answer_0=^?^Actually I was thinking about military service. Is that still a possibility?
chat_system_1329609773_snap_16_answer_1=^?^Of course all that sounds pretty good. But I have always dreamt of glorious feats, not about hunting for treasure.
chat_system_1329609773_snap_17_question=^?^Don't worry; your future life will be a thousand times more interesting and dangerous than you've dreamed. You'll explore deep caves, high mountains and faraway countries. Probably all Endoria will know your name, [player]!<br>In the name of all the Council of Mentors of the Knight's School of Darion, I, Chief Mentor, Iron Richard proclaim you to be a full knight.<br>Be honest and fair. Carry the title with pride and dignity. And may your deeds for the glory of Darion, and your knight's honor, bring you fame throughout the centuries.
chat_system_1329609773_snap_17_answer_0=^?^I serve Darion!
chat_system_1329609773_snap_19_question=^?^I am recommending you for the royal service as a Treasure Searcher. Here, take these reference letters to his Majesty, King Mark the Wise.<br>And don't forget your teacher! Come by the Knight's Temple whenever you like. I will always be glad to see you. After these years together, you've become almost like a son to me. Young, high spirited and certainly talented, you'll become a fine knight. Now get out of here, they're waiting for you in the castle, and I've got a couple more of you knuckleheads that I need to test.
chat_system_1329609773_snap_19_answer_0=^?^Thank you, mentor! See you later.
chat_system_1329609773_snap_14_question=^?^Wow!<br>[s]Iron Master looks at you closely:[/s]<br>Indeed I did hide 100 coins. Most commendable, young man. Honesty is always good. Why did you decide not to tell a lie? You could have said that you didn't see the money, and then take it for yourself.
chat_system_1329609773_snap_14_answer_0=^?^Honesty is one of the highest virtues. And to lie and covet only increases the burden of those sins lying in every man's soul.
chat_system_1329609773_snap_14_header_0=^?^Oh, maybe I won't ever understand the intricacies of the warriors of the light. Honor, faith, all these stupid vows. Although you are good fighters and doctors, I must say.<br><br>Anyway, such honesty is worthy of reward! Here are 50 coins - they're yours, and you deserve them.
chat_system_1329609773_snap_14_answer_1=^?^Well, I said that without thinking...
chat_system_1329609773_snap_14_header_1=^?^That's true. As I've always told you, shorten your tongue that you may lengthen your thoughts.<br><br>Anyway, such honesty is worthy of a reward. Here are 50 coins. They are yours and you deserve them.
chat_system_1329609773_snap_14_answer_2=^?^I don't like to tell lies. And the amount is not so great as to blacken myself with lies for it.
chat_system_1329609773_snap_14_header_2=^?^Well done, [player]! Always behave honestly. And such honesty is worthy of a reward! Here are 50 coins - they're yours, and you deserve them.
chat_system_1329609773_switch_4_header_0=^?^Why are you asking how? With a shovel of course! Choose a suspicious looking place, where in your opinion the treasure is probably situated, and dig. If you guess right, you get the treasure. If not - a couple of work callouses and a pile of dirt.<br><br>[s]When you near the treasure, above the ground there will appear a luminescence. To dig out the treasure, simply push the button near the radar with the image of a shovel, or push the hot key "D".[/s]
chat_system_1329609773_snap_4_question=^?^Fine! Good job, [player].<br>By the way, did you happen to notice anything unusual about this necromancer?
chat_system_1329609773_snap_4_answer_0=^?^What should I have noticed? He had a terrible face, and he was commanding skeletons. A typical necromancer.
chat_system_1329609773_snap_4_header_0=^?^No, he's not a usual necromancer. The spells he used in the combat are not like those which the mages of the death normally use. And the strength of the skeletons in his troop was lower than usual.<br>Actually, it was not a necromancer at all. It's Father William, one of the temple's priors, who kindly agreed to play the role of the necromancer in the Test.<br>He's aged, naturally, and his spells don't work well with the undead. The point is, undead creatures under his command take more penalties.
chat_system_1329609773_snap_4_answer_1=^?^Magic. He didn't use the spells that necromancers normally use.
chat_system_1329609773_snap_4_answer_2=^?^His aura... It was the aura of a priest, and the undead creatures in his troop were afraid of their commander.
chat_system_1329609773_snap_5_question=^?^You are right! Actually, it was not a necromancer at all. It was Father William, one of the temple's priors, who kindly agreed to play the role of the necromancer in the Test.<br><br>He's aged, naturally, and his spells don't work well with the undead. The point is, undead creatures under his command take more penalties.
chat_system_1329609773_snap_5_answer_0=^?^Does that mean I killed Father William?!
chat_system_1329609773_snap_21_question=^?^Don't worry; it's not the first time he took part in the test. Actually he is perfectly alright and is waiting for the next student to come in. Ok, give me the damned Book.
chat_system_1329609773_snap_21_answer_0=^?^Here it is, safe and sound. What's the last Test?
chat_system_1329609773_snap_7_question=^?^Yes, only the final test remains. You know that ancient temples and abandoned treasuries are the main source of gold and rare magic artifacts and spells. So searching for treasures and artifacts will be your next step.<br>Go into the catacombs. There are a few chests buried there, and in one of them there's a piece of my armor. You must bring it back, and the rest of the rags you can take for yourself. Is that clear?
chat_system_1329609773_snap_7_answer_0=^?^It's clear!
chat_system_1329609773_snap_7_answer_1=^?^I'm to dig out the treasure? How should I do that?
chat_system_1329609773_snap_3_question=^?^Fine! I hope the dragon made you run a lot, [player]? Give me the dummy; it needs to be saved a couple more times today.
chat_system_1329609773_snap_3_answer_0=^?^Take it. So, what's next?
chat_system_1329609773_snap_20_question=^?^The nest test will be more difficult.<br>In the second room, a malicious necromancer with a whole army of skeletons and zombies awaits you. You are to kill the villain and take the Book of Death from him. Is that clear?<br>Ah yes. Take these scrolls. I think that they will come in handy in your combat with the dark wizard. The necromancer will use magic for sure, so keep your eyes open.
chat_system_1329609773_snap_20_answer_0=^?^No problem. I'll kill the necromancer.
chat_system_1329609773_snap_20_answer_1=^?^Ok, I'll kill him! But how do I use magic scrolls?
